"下载" = "Download";
"从相册中选择" = "Select from Album";
"保存" = "Save";
"保存成功" = "Saved Successfully";
"关于我们" = "About Us";
"分享" = "Share";
"删除" = "Delete";
"删除视频" = "Delete Video";
"取消" = "Cancel";
"可在此执行下载" = "Download Available Here";
"已解析" = "Parsed";
"打开设置" = "Open Settings";
"播放" = "Play";
"播放器" = "Player";
"无访问相册权限" = "No Album Access Permission";
"更多" = "More";
"添加备注 +" = "Add Note +";
"相册访问授权失败" = "Album Access Authorization Failed";
"确定要删除该视频吗？" = "Are you sure you want to delete this video?";
"粘贴TikTok视频链接..." = "Paste TikTok Video Link...";
"获取视频" = "Get Video";
"视频解析" = "Video Parsing";
"解析成功，是否下载" = "Parsing Successful, Download?";
"解析输入" = "Parsing Input";
"设置" = "Settings";
"请输入有效的视频地址" = "Please enter a valid video URL";
"请输入要播放的视频链接..." = "Please enter a video link to play...";
"请输入视频地址" = "Please enter a video URL";
"返回" = "Back";

"清空" = "Clear";
"是否确认清空所有下载" = "Are you sure to clear all downloads";
"请先输入TikTok视频链接" = "Please enter the TikTok video link first";
"重新输入" = "Re-enter";
"随机下载" = "Random download";
"解析中" = "Analyzing...";

"下载准备" = "Preparing…";
"下载中" = "Downloading…";
"暂停" = "Paused";
"下载成功" = "Download successful";
"下载失败" = "Download failed";
"未知" = "Unknown";
"开始" = "Start";
"暂停" = "Pause";
"继续" = "Resume";
"完成" = "Completed";
"重下" = "Redownload";

"视频" = "Video";
"音频" = "Audio";
"图片" = "Image";
"是否要保存【%@】到相册" = "Do you want to save [%@] to the album?";
"请选择您要保存的内容" = "Please select the content you want to save";
"保存视频" = "Save video";
"仅保存音频" = "Save audio only";
